# 3. Напишите программу, которая определит позицию второго вхождения 
#      строки в 
#    списке либо сообщит, что её нет.

# *Пример:*

# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1



test_str = (input('Введите строку: '))

test_list = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]



def Search_Str(list_1, test_str):
    count = 0
    for i in range(0, len(test_list)):
        if test_str == test_list[i] and count == 0:
            count += 1
        elif test_str == test_list[i] and count == 1:
            print(f"ищем: {test_str}, ответ: {i}")


Search_Str(test_list, test_str)